code-review/NRB_3471_3546/База_Было/DataProcessors/УведомленияПоВыплатамКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УведомленияПоВыплатамКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперацииД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>clientId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>securityName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>gosRegNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>isin</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>rateSize</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>12</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>rateCurrency</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>incomeAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>incomeCurrency</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>bondsPaymentType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>dateCutOff</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>accrualCurrency</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>taxCurrency</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>accrualAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>taxAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>d1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>d2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>messageId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоговора</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СтатусыДоставкиУведомленийВКабинетКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДоставкиУведомленийВКабинетКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгруженИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженВКабинетКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбойОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЦБ</Name>
			<Comment>Типы ценных бумаг</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
					<Comment>Акция</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигация</Name>
					<Comment>Облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вексель</Name>
					<Comment>Вексель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АДР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГДР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пай</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Золото</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарнаяРасписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСертификатУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Варрант</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВидыАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыАкций</Name>
			<Comment>Виды акций</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обыкновенная</Name>
					<Comment>Обыкновенная</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Привилегированная</Name>
					<Comment>Привилегированная</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/УведомленияПоВыплатамКД/Ext/ObjectModule.bsl
Процедура ЗаполнитьДанные(Отбор = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленныйНалог.Основание КАК Поручение,
	|	НачисленныйНалог.СчетДепо КАК СчетДепо,
	|	НачисленныйНалог.РазделСчетаДепо КАК РазделСчетаДепо,
	|	СУММА(НачисленныйНалог.СуммаНалога + НачисленныйНалог.СуммаНалогаПоСтавке15СПревышения) КАК ИтогоСуммаНалога
	|ПОМЕСТИТЬ втСуммыПоДокументамНачисленныйНалог
	|ИЗ
	|	Документ.НачисленныйНалог КАК НачисленныйНалог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияЛичныйКабинет
	|		ПО НачисленныйНалог.Основание = УведомленияЛичныйКабинет.КД
	|			И НачисленныйНалог.СчетДепо = УведомленияЛичныйКабинет.СчетДепо
	|			И (УведомленияЛичныйКабинет.СтатусДоставкиУведомления = &КОтправке)
	|ГДЕ
	|	НачисленныйНалог.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленныйНалог.Основание,
	|	НачисленныйНалог.СчетДепо,
	|	НачисленныйНалог.РазделСчетаДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоручениеЦБСписываемые.Ссылка КАК Поручение,
	|	ПоручениеЦБСписываемые.СчетДепо КАК СчетДепо,
	|	ПоручениеЦБСписываемые.Ссылка.ВидОперацииД КАК ВидОперацииД,
	|	ЕСТЬNULL(КодыЗагрузки.Код, """") КАК clientId,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДивидендов
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДоходаПрочие
	|			ТОГДА ВЫБОР
	|					КОГДА ПоручениеЦБСписываемые.Ссылка.ЦБ.ТипЦБ = &Акция
	|							ИЛИ ПоручениеЦБСписываемые.Ссылка.ЦБ.ТипЦБ = &Облигация
	|						ТОГДА ВЫБОР
	|								КОГДА ПоручениеЦБСписываемые.Ссылка.ЦБ.ВидЦБ = &Обыкновенная
	|									ТОГДА ПоручениеЦБСписываемые.Ссылка.ЦБ.Эмитент.Наименование + "" / АО /""
	|								ИНАЧЕ ПоручениеЦБСписываемые.Ссылка.ЦБ.Эмитент.Наименование + "" / АП /""
	|							КОНЕЦ
	|					ИНАЧЕ ПоручениеЦБСписываемые.Ссылка.ЦБ.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ПоручениеЦБСписываемые.Ссылка.ЦБ.Эмитент.Наименование
	|	КОНЕЦ КАК securityName,
	|	ПоручениеЦБСписываемые.Ссылка.ЦБ.НомерРегистрации КАК gosRegNumber,
	|	ПоручениеЦБСписываемые.Ссылка.ЦБ.ISIN КАК isin,
	|	ПоручениеЦБСписываемые.Количество КАК quantity,
	|	ПоручениеЦБСписываемые.Ссылка.Валюта.НаименованиеДляОтчетов КАК rateCurrency,
	|	ПоручениеЦБСписываемые.Ссылка.Валюта.НаименованиеДляОтчетов КАК incomeCurrency,
	|	ВЫБОР ПоручениеЦБСписываемые.Ссылка.ВидОперацииД
	|		КОГДА &ПогашениеЦБПолное
	|			ТОГДА ""Full""
	|		КОГДА &ПогашениеЦБЧастичное
	|			ТОГДА ""Partial""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК bondsPaymentType,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &ПогашениеЦБПолное
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &ПогашениеЦБЧастичное
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &ПогашениеНКД
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДивидендов
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДоходаПрочие
	|			ТОГДА ПоручениеЦБСписываемые.Ссылка.ДатаФиксации
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК dateCutOff,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &ПогашениеНКД
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДивидендов
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДоходаПрочие
	|			ТОГДА ПоручениеЦБСписываемые.Ссылка.Валюта.НаименованиеДляОтчетов
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК accrualCurrency,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &ПогашениеНКД
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДивидендов
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДоходаПрочие
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ПоручениеЦБСписываемые.Ссылка.ЦБ.ВидЦББанкаРоссии.ИностраннаяЦБ, ЛОЖЬ)
	|						ТОГДА ПоручениеЦБСписываемые.Ссылка.Валюта.НаименованиеДляОтчетов
	|					ИНАЧЕ &ВалютаРегУчетаНаименованиеДляОтчетов
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК taxCurrency,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &ПогашениеНКД
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДивидендов
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДоходаПрочие
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ПоручениеЦБСписываемые.Ссылка.ЦБ.ВидЦББанкаРоссии.ИностраннаяЦБ, ЛОЖЬ)
	|						ТОГДА ПоручениеЦБСписываемые.СуммаКВыплатеПоИПД + ПоручениеЦБСписываемые.СуммаНалога
	|					ИНАЧЕ ПоручениеЦБСписываемые.Сумма
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК accrualAmount,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &ПогашениеНКД
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДивидендов
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДоходаПрочие
	|			ТОГДА ВЫБОР
	|					КОГДА ПоручениеЦБСписываемые.НДФЛУдержан
	|						ТОГДА ПоручениеЦБСписываемые.СуммаНалога
	|					ИНАЧЕ ЕСТЬNULL(СуммыПоДокументамНачисленныйНалог.ИтогоСуммаНалога, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК taxAmount,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДивидендов
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДоходаПрочие
	|			ТОГДА ПоручениеЦБСписываемые.Ссылка.КоэффициентД1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК d1,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДивидендов
	|				ИЛИ ПоручениеЦБСписываемые.Ссылка.ВидОперацииД = &НачислениеДоходаПрочие
	|			ТОГДА ПоручениеЦБСписываемые.Ссылка.КоэффициентД2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК d2,
	|	ЕСТЬNULL(ПоручениеЦБСписываемые.Ссылка.ЦБ.ВидЦББанкаРоссии.ИностраннаяЦБ, ЛОЖЬ) КАК ЭтоИностраннаяЦБ,
	|	ПоручениеЦБСписываемые.СуммаКВыплатеПоИПД КАК СуммаКВыплатеПоИПД,
	|	ВЫБОР
	|		КОГДА ПоручениеЦБСписываемые.Ссылка.ЦБ.ТипЦБ = &Облигация
	|				И ПоручениеЦБСписываемые.Ссылка.ЦБ.ВидЦБ = &ГосударственнаяОблигация
	|				И ПоручениеЦБСписываемые.Ссылка.Валюта <> &ВалютаРегУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЕврооблигацияМинфина,
	|	ПоручениеЦБСписываемые.Сумма КАК Сумма,
	|	ПоручениеЦБСписываемые.Ссылка.ВыплатаНа1ЦБ КАК ВыплатаНа1ЦБ,
	|	ПоручениеЦБСписываемые.СчетДепо.Владелец КАК Клиент,
	|	ПоручениеЦБСписываемые.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ втШаг1
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦБСписываемые
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияЛичныйКабинет
	|		ПО ПоручениеЦБСписываемые.Ссылка = УведомленияЛичныйКабинет.КД
	|			И ПоручениеЦБСписываемые.СчетДепо = УведомленияЛичныйКабинет.СчетДепо
	|			И (УведомленияЛичныйКабинет.СтатусДоставкиУведомления = &КОтправке)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ПоручениеЦБСписываемые.СчетДепо.Владелец.ЮридическиеФизическиеЛица = КодыЗагрузки.Владелец
	|			И (КодыЗагрузки.Биржа = &Клиенты)
	|			И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузки.ДатаОкончанияДействия > ПоручениеЦБСписываемые.Ссылка.Дата)
	|			И (НЕ КодыЗагрузки.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСуммыПоДокументамНачисленныйНалог КАК СуммыПоДокументамНачисленныйНалог
	|		ПО ПоручениеЦБСписываемые.Ссылка = СуммыПоДокументамНачисленныйНалог.Поручение
	|			И ПоручениеЦБСписываемые.СчетДепо = СуммыПоДокументамНачисленныйНалог.СчетДепо
	|			И ПоручениеЦБСписываемые.РазделСчетаДепо = СуммыПоДокументамНачисленныйНалог.РазделСчетаДепо
	|ГДЕ
	|	&УсловиеОтбора
	|	И ПоручениеЦБСписываемые.Ссылка.Проведен
	|	И ПоручениеЦБСписываемые.Ссылка.ВидОперацииД В(&РазрешенныеВидыОпераций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШаг1.Поручение КАК Поручение,
	|	втШаг1.СчетДепо КАК СчетДепо,
	|	МАКСИМУМ(втШаг1.ВидОперацииД) КАК ВидОперацииД,
	|	МАКСИМУМ(втШаг1.clientId) КАК clientId,
	|	МАКСИМУМ(втШаг1.securityName) КАК securityName,
	|	МАКСИМУМ(втШаг1.gosRegNumber) КАК gosRegNumber,
	|	МАКСИМУМ(втШаг1.isin) КАК isin,
	|	СУММА(втШаг1.quantity) КАК quantity,
	|	МАКСИМУМ(втШаг1.rateCurrency) КАК rateCurrency,
	|	МАКСИМУМ(втШаг1.incomeCurrency) КАК incomeCurrency,
	|	СУММА(ВЫБОР
	|			КОГДА втШаг1.ЭтоИностраннаяЦБ
	|				ТОГДА втШаг1.СуммаКВыплатеПоИПД
	|			ИНАЧЕ ВЫБОР
	|					КОГДА втШаг1.ВидОперацииД = &Выкуп
	|							ИЛИ втШаг1.ВидОперацииД = &ПогашениеЦБПолное
	|							ИЛИ втШаг1.ВидОперацииД = &ПогашениеЦБЧастичное
	|						ТОГДА втШаг1.Сумма
	|					КОГДА втШаг1.ВидОперацииД = &ПогашениеНКД
	|							ИЛИ втШаг1.ВидОперацииД = &НачислениеДивидендов
	|							ИЛИ втШаг1.ВидОперацииД = &НачислениеДоходаПрочие
	|						ТОГДА втШаг1.accrualAmount - ВЫБОР
	|								КОГДА НЕ втШаг1.ЭтоЕврооблигацияМинфина
	|									ТОГДА втШаг1.taxAmount
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК incomeAmount,
	|	МАКСИМУМ(втШаг1.ВыплатаНа1ЦБ) КАК rateSize,
	|	МАКСИМУМ(втШаг1.bondsPaymentType) КАК bondsPaymentType,
	|	МАКСИМУМ(втШаг1.dateCutOff) КАК dateCutOff,
	|	МАКСИМУМ(втШаг1.accrualCurrency) КАК accrualCurrency,
	|	МАКСИМУМ(втШаг1.taxCurrency) КАК taxCurrency,
	|	СУММА(втШаг1.accrualAmount) КАК accrualAmount,
	|	СУММА(втШаг1.taxAmount) КАК taxAmount,
	|	МАКСИМУМ(втШаг1.d1) КАК d1,
	|	МАКСИМУМ(втШаг1.d2) КАК d2,
	|	втШаг1.Клиент КАК Клиент,
	|	втШаг1.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ДатаНачалоДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Код, """") КАК НомерДоговора,
	|	ВЫБОР
	|		КОГДА втШаг1.Клиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """")
	|		ИНАЧЕ ""клиент""
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА втШаг1.Клиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """")
	|		ИНАЧЕ втШаг1.Клиент.Наименование
	|	КОНЕЦ КАК Имя
	|ИЗ
	|	втШаг1 КАК втШаг1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО втШаг1.Клиент = ДоговорыКонтрагентов.Владелец
	|			И втШаг1.Клиент.Код = ДоговорыКонтрагентов.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						втШаг1.Клиент.ЮридическиеФизическиеЛица КАК КлиентЮридическиеФизическиеЛица
	|					ИЗ
	|						втШаг1 КАК втШаг1)) КАК ФИОФизЛицСрезПоследних
	|		ПО втШаг1.Клиент.ЮридическиеФизическиеЛица = ФИОФизЛицСрезПоследних.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	втШаг1.Поручение,
	|	втШаг1.СчетДепо,
	|	втШаг1.Клиент,
	|	втШаг1.ЦеннаяБумага,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ДатаНачалоДействия, ДАТАВРЕМЯ(1, 1, 1)),
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Код, """"),
	|	ВЫБОР
	|		КОГДА втШаг1.Клиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """")
	|		ИНАЧЕ ""клиент""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА втШаг1.Клиент.ЮридическиеФизическиеЛица ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """")
	|		ИНАЧЕ втШаг1.Клиент.Наименование
	|	КОНЕЦ";
	РазрешенныеВидыОпераций = Новый Массив;
	РазрешенныеВидыОпераций.Добавить(Справочники.ВидыОпераций.Выкуп);
	РазрешенныеВидыОпераций.Добавить(Справочники.ВидыОпераций.ПогашениеНКД);
	РазрешенныеВидыОпераций.Добавить(Справочники.ВидыОпераций.ПогашениеЦБПолное);
	РазрешенныеВидыОпераций.Добавить(Справочники.ВидыОпераций.ПогашениеЦБЧастичное);
	РазрешенныеВидыОпераций.Добавить(Справочники.ВидыОпераций.НачислениеДивидендов);
	РазрешенныеВидыОпераций.Добавить(Справочники.ВидыОпераций.НачислениеДоходаПрочие);
	Запрос.УстановитьПараметр("РазрешенныеВидыОпераций", РазрешенныеВидыОпераций);
	
	Запрос.УстановитьПараметр("КОтправке", Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.КОтправке);
	Запрос.УстановитьПараметр("Выкуп", Справочники.ВидыОпераций.Выкуп);
	Запрос.УстановитьПараметр("НачислениеДивидендов", Справочники.ВидыОпераций.НачислениеДивидендов);
	Запрос.УстановитьПараметр("НачислениеДоходаПрочие", Справочники.ВидыОпераций.НачислениеДоходаПрочие);
	Запрос.УстановитьПараметр("ПогашениеНКД", Справочники.ВидыОпераций.ПогашениеНКД);
	Запрос.УстановитьПараметр("ПогашениеЦБПолное", Справочники.ВидыОпераций.ПогашениеЦБПолное);
	Запрос.УстановитьПараметр("ПогашениеЦБЧастичное", Справочники.ВидыОпераций.ПогашениеЦБЧастичное);
	Запрос.УстановитьПараметр("Клиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Запрос.УстановитьПараметр("Акция", Перечисления.ТипыЦБ.Акция);
	Запрос.УстановитьПараметр("Облигация", Перечисления.ТипыЦБ.Облигация);
	Запрос.УстановитьПараметр("Обыкновенная", Перечисления.ВидыАкций.Обыкновенная);
	Запрос.УстановитьПараметр("ВалютаРегУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаРегУчетаНаименованиеДляОтчетов", Запрос.Параметры.ВалютаРегУчета.НаименованиеДляОтчетов);
	Запрос.УстановитьПараметр("ДатаНачалаНачисленияНДФЛНаГособлигации", Константы.ДатаНачалаНачисленияНДФЛНаГособлигации.Получить());
	Запрос.УстановитьПараметр("ГосударственнаяОблигация", Перечисления.ВидыОблигаций.Государственная);
	
	Если ТипЗнч(Отбор) = Тип("Структура") И Отбор.Свойство("Поручение") Тогда
		Запрос.УстановитьПараметр("Поручение", Отбор.Поручение);
		УсловиеОтбора = "ПоручениеЦБСписываемые.Ссылка = &Поручение";
	Иначе
		УсловиеОтбора = "Истина";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", УсловиеОтбора);
	Выборка = Запрос.Выполнить().Выбрать();
	Данные.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Данные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.clientId = СокрЛП(НоваяСтрока.clientId);
	КонецЦикла;
КонецПроцедуры

Процедура ПодготовитьУведомления() Экспорт
	Для Каждого СтрокаТЧ Из Данные Цикл
		Документы.Поручение.ЗаписатьУведомлениеДляКабинетаКлиента(СтрокаТЧ.Поручение, ТекущаяДатаСеанса(), СтрокаТЧ,
				Перечисления.СтатусыДоставкиУведомленийВКабинетКлиента.ВыгруженИз1С);
				
		ЗаписатьУведомлениеПоСтроке(СтрокаТЧ);
		
		Расшифровка = СокрЛП(СтрокаТЧ.Поручение) + " Счет депо: " + СокрЛП(СтрокаТЧ.СчетДепо);
		ЗаписьЖурналаРегистрации("Уведомления СУДК", УровеньЖурналаРегистрации.Информация, , ,
			"Отправлено уведомление по " + Расшифровка);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьУведомлениеПоСтроке(ДанныеУведомления)
	
	ОбъектJSON = Новый Структура();
	
	ТопикEmailGen = ДанныеУведомления.Клиент.СпособОтправкиОтчетов = Перечисления.СпособыОтправкиОтчетов.EmailCustody;
	
	MessageInfo = ПодготовитьБлокMessageInfo(ДанныеУведомления.messageId, ТопикEmailGen);
	Data = ПодготовитьБлокData(ДанныеУведомления, ТопикEmailGen);
	
	ОбъектJSON.Вставить("MessageInfo", MessageInfo);
	ОбъектJSON.Вставить("Data", Data);
	
	Если ТопикEmailGen Тогда
		Ключ = "EmailGen";
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmailGen;
	Иначе
		Ключ = "EmailExchange";
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmail;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ОбъектJSON);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, СтрокаJSON, , ДанныеУведомления.Поручение);

КонецПроцедуры

Функция ПодготовитьБлокData(ДанныеУведомления, ТопикEmailGen = Ложь)
	
	Data = Новый Структура();
	
	Если ТопикEmailGen Тогда
		Email = ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("EmailДепозитарногоОтдела");
		Data.Вставить("Email", Email);
	Иначе
		Data.Вставить("NotificationType", "Client");
		Data.Вставить("CrmClientId", ДанныеУведомления.clientId);
		Data.Вставить("Email", Неопределено);
	КонецЕсли;
	
	Data.Вставить("MailTemplateId", Неопределено);
	Data.Вставить("MailTemplateTitle", "СообщениеОВыплате");
	
	ReplaceFields = ПодготовитьБлокReplaceFields(ДанныеУведомления, ТопикEmailGen);
	Data.Вставить("ReplaceFields", ReplaceFields);
	
	Возврат Data;

КонецФункции

Функция ПодготовитьБлокReplaceFields(ДанныеУведомления, ТопикEmailGen)
	
	КоличествоЦБ = "";
	СтавкаДоходаНаЦБРазмер = "";
	СтавкаДоходаНаЦБВалюта = "";
	СуммаНачисления = "";
	ВалютаСуммыНачисления = "";
	СуммаУдержанногоНалога = "";
	ВалютаСуммыУдержанногоНалога = "";
	СуммДохКВыплате = "";
	ВалютаСуммыДохКВыплате = "";
	
	Если ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.Выкуп Тогда
		ВидВыплаты = "денежных средств за выкупленные ценные бумаги";
		КоличествоЦБ = Строка(ДанныеУведомления.quantity);
	ИначеЕсли ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное
		Или ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБЧастичное Тогда
		Если ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное Тогда
			ВидВыплаты = "номинальной стоимости при погашении облигаций";
		Иначе
			ВидВыплаты = "части номинальной стоимости по облигациям";
		КонецЕсли;
	ИначеЕсли ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Тогда
		ВидВыплаты = "купонного дохода по облигациям";
	ИначеЕсли ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов Тогда
		ВидВыплаты = "дивидендов";
	ИначеЕсли ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.НачислениеДоходаПрочие Тогда
		ВидВыплаты = "дохода";
	КонецЕсли;
	
	ФорматДляЧисла = "ЧГ=0";
	Если ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.Выкуп
		Или ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБПолное
		Или ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеЦБЧастичное
		Или ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД Тогда
		СтавкаДоходаНаЦБРазмер = Формат(ДанныеУведомления.rateSize, ФорматДляЧисла);
		СтавкаДоходаНаЦБВалюта = ДанныеУведомления.rateCurrency;
	КонецЕсли;
	
	Если (ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.ПогашениеНКД
		Или ДанныеУведомления.ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов)
		И ДанныеУведомления.incomeCurrency = "RUB" Тогда
		СуммаНачисления = Формат(ДанныеУведомления.accrualAmount, ФорматДляЧисла);
		ВалютаСуммыНачисления = ДанныеУведомления.accrualCurrency;
		СуммаУдержанногоНалога = Формат(ДанныеУведомления.taxAmount, ФорматДляЧисла);
		ВалютаСуммыУдержанногоНалога = ДанныеУведомления.taxCurrency;
	КонецЕсли;
	
	ReplaceFields = Новый Структура;
	Если ТопикEmailGen Тогда
		ReplaceFields.Вставить("Имя", ДанныеУведомления.Имя);
		ReplaceFields.Вставить("Фамилия", ДанныеУведомления.Фамилия);
		ReplaceFields.Вставить("НомерДоговора", СокрЛП(ДанныеУведомления.НомерДоговора));
		ReplaceFields.Вставить("ДатаДоговора", Формат(ДанныеУведомления.ДатаДоговора, "ДЛФ=Д"));
	КонецЕсли;
	ReplaceFields.Вставить("ВидВыплаты", 					ВидВыплаты);
	ReplaceFields.Вставить("НаименованиеЦБ", 				ДанныеУведомления.securityName);
	ReplaceFields.Вставить("РегНомер", 						ДанныеУведомления.gosRegNumber);
	ReplaceFields.Вставить("ISIN", 							ДанныеУведомления.isin);
	ReplaceFields.Вставить("КоличествоЦБ", 					КоличествоЦБ);
	ReplaceFields.Вставить("СтавкаДоходаНаЦБРазмер", 		СтавкаДоходаНаЦБРазмер);
	ReplaceFields.Вставить("СтавкаДоходаНаЦБВалюта", 		СтавкаДоходаНаЦБВалюта);
	ReplaceFields.Вставить("СуммаНачисления", 				СуммаНачисления);
	ReplaceFields.Вставить("ВалютаСуммыНачисления", 		ВалютаСуммыНачисления);
	ReplaceFields.Вставить("СуммаУдержанногоНалога", 		СуммаУдержанногоНалога);
	ReplaceFields.Вставить("ВалютаСуммыУдержанногоНалога", 	ВалютаСуммыУдержанногоНалога);
	ReplaceFields.Вставить("СуммДохКВыплате", 				Формат(ДанныеУведомления.incomeAmount, ФорматДляЧисла));
	ReplaceFields.Вставить("ВалютаСуммыДохКВыплате", 		ДанныеУведомления.incomeCurrency);
	
	Возврат ReplaceFields;

КонецФункции

Функция ПодготовитьБлокMessageInfo(MessageId, EmailGen = Ложь)
	
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	Если EmailGen Тогда
		MessageInfo.Вставить("MessageType", "EmailGen");
	Иначе
		MessageInfo.Вставить("MessageType", "Email");
	КонецЕсли;
	
	MessageInfo.Вставить("JsonVersion", "1.0.0");
	MessageInfo.Вставить("MessageId", MessageId);
	MessageInfo.Вставить("MasterMessageId", MessageId);
	MessageInfo.Вставить("ParentMessageId", Неопределено);
	MessageInfo.Вставить("SystemSource", "Depo");
	MessageInfo.Вставить("DateTimeCreate", ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO));
	MessageInfo.Вставить("ActionType", "INS");
	
	Возврат MessageInfo;

КонецФункции
